open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
/****************************************************************************
 * chips/bk7258/ap/
 * bk7258_ap_smp_advanced.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * N8-C5 bidirectional pingpong, N8-C6 dual CPU1 tasks, N8-C7 controlled
 * migration, N8-C8 timed wake, and N8-D1 scheduler quiesce/resume.  Uses the
 * shared generic advanced-stage ABI struct at offsets 0x480..0x680.  Compiled
 * only when one advanced config symbol is enabled; otherwise the file is
 * empty.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#if defined(CONFIG_BK7258_AP_SMP_BIDIR_PINGPONG) || \
    defined(CONFIG_BK7258_AP_SMP_CPU1_DUALTASK) || \
    defined(CONFIG_BK7258_AP_SMP_CONTROLLED_MIGRATION) || \
    defined(CONFIG_BK7258_AP_SMP_CPU1_TIMED_WAKE) || \
    defined(CONFIG_BK7258_AP_SMP_LIFECYCLE_QUIESCE)

#include <errno.h>
#include <pthread.h>
#include <sched.h>
#include <stdint.h>
#include <string.h>
#include <sys/types.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/sched.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_amp.h>
#include <arch/chip/irq.h>

#include "arm_internal.h"
#include "sched/sched.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if !defined(CONFIG_SMP)
#  error BK7258 advanced SMP tests require CONFIG_SMP
#endif

#if CONFIG_SMP_NCPUS != 2
#  error N8-C5..D1 support exactly two AP logical CPUs
#endif

#if CONFIG_SMP_DEFAULT_CPUSET != 0x1
#  error N8-C5..D1 must keep ordinary tasks on AP logical CPU0
#endif

#define BK7258_AP_PRIMARY_CPU     0
#define BK7258_AP_SECONDARY_CPU   1

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_BIDIR_PINGPONG
static sem_t g_bp2p_sem[2];
#endif

#ifdef CONFIG_BK7258_AP_SMP_CPU1_DUALTASK
static sem_t g_bdul_sem[2];
#endif

#ifdef CONFIG_BK7258_AP_SMP_CONTROLLED_MIGRATION
struct bmig_rendezvous_s
{
  volatile struct bk7258_ap_advanced_state_s *state;
  pthread_t thread;
  cpu_set_t target;
  volatile uint32_t target_cpu;
  volatile uint32_t cycle;
  volatile uint32_t callback_started;
  volatile uint32_t callback_completed;
};

static sem_t g_bmig_sem;
static struct smp_call_data_s g_bmig_call;
static struct bmig_rendezvous_s g_bmig_rendezvous;
#endif

#ifdef CONFIG_BK7258_AP_SMP_LIFECYCLE_QUIESCE
static struct smp_call_data_s g_blcy_quiesce_call;
#endif

/****************************************************************************
 * Private Helpers
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_BIDIR_PINGPONG
/* PID-release check without taking a TCB reference. */

static int bk7258_ap_pid_released(pthread_t thread)
{
  pid_t pid = (pid_t)thread;
  irqstate_t flags;
  int released = 1;
  int hash_ndx;

  flags = spin_lock_irqsave_notrace(&g_pidhashlock);
  if (g_pidhash != NULL && g_npidhash > 0 && pid >= 0)
    {
      hash_ndx = PIDHASH(pid);
      if (g_pidhash[hash_ndx] != NULL &&
          g_pidhash[hash_ndx]->pid == pid)
        {
          released = 0;
        }
    }

  spin_unlock_irqrestore_notrace(&g_pidhashlock, flags);
  return released;
}
#endif

/****************************************************************************
 * N8-C5 Bidirectional Pingpong
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_BIDIR_PINGPONG

static int bp2p_attr_initialize(pthread_attr_t *attr, cpu_set_t cpuset,
                                int priority)
{
  struct sched_param param;
  int initialized = 0;
  int ret;

  ret = pthread_attr_init(attr);
  if (ret == 0)
    {
      initialized = 1;
      ret = pthread_attr_setdetachstate(attr, PTHREAD_CREATE_DETACHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setaffinity_np(attr, sizeof(cpuset), &cpuset);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setinheritsched(attr, PTHREAD_EXPLICIT_SCHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setschedpolicy(attr, SCHED_FIFO);
    }

  if (ret == 0)
    {
      memset(&param, 0, sizeof(param));
      param.sched_priority = priority;
      ret = pthread_attr_setschedparam(attr, &param);
    }

  if (ret != 0 && initialized)
    {
      (void)pthread_attr_destroy(attr);
    }

  return ret;
}

/* Each BP2P semaphore is private to this test and has exactly one waiter.
 * A count of -1 therefore proves that the corresponding task is blocked on
 * that exact semaphore.  Do not inspect the remote CPU's TCB here: acquiring
 * a TCB reference and then entering the global scheduler critical section can
 * contend with the semaphore block/context-switch path that this test is
 * trying to observe.
 */

static int32_t bp2p_private_waiter(sem_t *sem)
{
  int32_t observed = INT32_MAX;
  int value = 0;
  int ret;

  ret = nxsem_get_value(sem, &value);
  if (ret >= 0 && value == -1)
    {
      observed = (int32_t)value;
    }

  __asm volatile ("dmb sy" ::: "memory");
  return observed;
}

static FAR void *bp2p_initiator_task(FAR void *arg)
{
  volatile struct bk7258_ap_advanced_state_s *state = arg;
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
  uint32_t cycle;
  uint32_t elapsed;
  int ret;

  if (state == NULL)
    {
      return NULL;
    }

  state->task_id[0] = (uint32_t)pthread_self();
  state->task_cpu[0] = (uint32_t)up_cpu_index();
  state->task_started[0]++;
  __asm volatile ("dmb sy" ::: "memory");

  for (cycle = 1; cycle <= BK7258_AP_ADV_CYCLES; cycle++)
    {
      /* Wait for responder to post (wake us). */

      for (elapsed = 0; elapsed < BK7258_AP_ADV_TIMEOUT_MS; elapsed++)
        {
          __asm volatile ("dmb sy" ::: "memory");
          if (state->state == BK7258_AP_BP2P_STATE_FAILED)
            {
              goto done;
            }

          if (state->sequence[1] == cycle - 1 &&
              state->task_completed[1] == 0)
            {
              break;
            }

          up_mdelay(1);
        }

      if (elapsed == BK7258_AP_ADV_TIMEOUT_MS &&
          cycle > 1)
        {
          state->error = BK7258_AP_BP2P_ERROR_WAIT_TIMEOUT;
          state->state = BK7258_AP_BP2P_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

