open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
  ret = pthread_getschedparam(pthread_self(), &controller_policy,
                              &controller_param);
  priority_max = sched_get_priority_max(SCHED_FIFO);
  if (ret != 0 || priority_max < 0 ||
      controller_param.sched_priority >= priority_max)
    {
      state->error = BK7258_AP_BP2P_ERROR_CREATE;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return ret != 0 ? -ret : -ERANGE;
    }

  (void)controller_policy;
  task_priority = controller_param.sched_priority + 1;

  /* Initialize two semaphores with count 0. */

  for (i = 0; i < 2; i++)
    {
      ret = nxsem_init(&g_bp2p_sem[i], 0, 0);
      if (ret < 0)
        {
          state->error = BK7258_AP_BP2P_ERROR_SEM_INIT;
          state->state = BK7258_AP_BP2P_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          return ret;
        }

#ifdef CONFIG_PRIORITY_INHERITANCE
      ret = nxsem_set_protocol(&g_bp2p_sem[i], SEM_PRIO_NONE);
      if (ret < 0)
        {
          state->error = BK7258_AP_BP2P_ERROR_SEM_INIT;
          state->state = BK7258_AP_BP2P_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          return ret;
        }
#endif
    }

  /* Create responder first (mask 0x2/CPU1). */

  ret = bp2p_attr_initialize(&attr, cpuset1, task_priority);
  if (ret != 0)
    {
      state->error = BK7258_AP_BP2P_ERROR_CREATE;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  state->state = BK7258_AP_BP2P_STATE_RUNNING;
  __asm volatile ("dmb sy" ::: "memory");

  ret = pthread_create(&thread[1], &attr, bp2p_responder_task,
                       (FAR void *)state);
  (void)pthread_attr_destroy(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BP2P_ERROR_CREATE;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  state->task_id[1] = (uint32_t)thread[1];
  __asm volatile ("dmb sy" ::: "memory");

  /* Create initiator (mask 0x1/CPU0). */

  ret = bp2p_attr_initialize(&attr, cpuset0, task_priority);
  if (ret != 0)
    {
      state->error = BK7258_AP_BP2P_ERROR_CREATE;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  ret = pthread_create(&thread[0], &attr, bp2p_initiator_task,
                       (FAR void *)state);
  (void)pthread_attr_destroy(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BP2P_ERROR_CREATE;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  state->task_id[0] = (uint32_t)thread[0];
  __asm volatile ("dmb sy" ::: "memory");

  /* Wait for both tasks to complete and PIDs to be released. */

  for (elapsed = 0; elapsed < timeout_ms * 3; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->task_completed[0] != 0 && state->task_completed[1] != 0)
        {
          if (bk7258_ap_pid_released(thread[0]) &&
              bk7258_ap_pid_released(thread[1]))
            {
              state->aux[0] = 1;
              state->aux[1] = 1;
              break;
            }
        }

      if (state->state == BK7258_AP_BP2P_STATE_FAILED)
        {
          return -EIO;
        }

      /* The diagnostic tasks outrank this CPU0 controller, so task creation
       * and each remote semaphore post can preempt it directly.  Keep the
       * controller out of the scheduler-locked sleep path, but explicitly
       * re-enter local scheduling after each bounded poll.  A CPU1 scheduler
       * IPI can make the CPU0 initiator ready just before exception return;
       * sched_yield() closes that missed-switch window without sleeping.
       */

      up_mdelay(1);
      (void)sched_yield();
    }

  if (elapsed == timeout_ms * 3)
    {
      state->error = BK7258_AP_BP2P_ERROR_WAIT_TIMEOUT;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ETIMEDOUT;
    }

  /* Verify final counter deltas. */

  __asm volatile ("dmb sy" ::: "memory");
  state->smp_tx0_after = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_after = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_after = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_after = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_after = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");

  if (state->state == BK7258_AP_BP2P_STATE_FAILED)
    {
      return -EIO;
    }

  /* CPU0->CPU1: +9 (1 dispatch + 8 wakes), CPU1->CPU0: +8, calls: +17 */

  if (state->smp_tx0_after != state->smp_tx0_before + 9 ||
      state->smp_rx1_after != state->smp_rx1_before + 9 ||
      state->smp_tx1_after != state->smp_tx1_before + 8 ||
      state->smp_rx0_after != state->smp_rx0_before + 8 ||
      state->calls_after != state->calls_before + 17)
    {
      state->error = BK7258_AP_BP2P_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  if (state->task_started[0] != 1 || state->task_started[1] != 1 ||
      state->task_completed[0] != 1 || state->task_completed[1] != 1 ||
      state->sequence[0] != BK7258_AP_ADV_CYCLES ||
      state->sequence[1] != BK7258_AP_ADV_CYCLES ||
      state->task_cpu[0] != BK7258_AP_PRIMARY_CPU ||
      state->task_cpu[1] != BK7258_AP_SECONDARY_CPU)
    {
      state->error = BK7258_AP_BP2P_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BP2P_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  state->completed = BK7258_AP_ADV_CYCLES;
  state->error = BK7258_AP_BP2P_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_BP2P_STATE_PASSED;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}

#endif /* CONFIG_BK7258_AP_SMP_BIDIR_PINGPONG */

/****************************************************************************
 * N8-C6 Dual CPU1 Local Scheduling
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_CPU1_DUALTASK

static int32_t bdul_exact_waiter(sem_t *sem, pthread_t thread,
                                  cpu_set_t cpuset)
{
  FAR struct tcb_s *tcb;
  irqstate_t flags;
  int32_t observed = INT32_MAX;
  int value = 0;
  int ret;

  tcb = nxsched_get_tcb((pid_t)thread);
  if (tcb == NULL)
    {
      return observed;
    }

  flags = enter_critical_section();
  ret = nxsem_get_value(sem, &value);
  if (ret >= 0 &&
      tcb->task_state == TSTATE_WAIT_SEM &&
      tcb->waitobj == (FAR void *)sem &&
      value == -1 && tcb->affinity == cpuset)
    {
      observed = (int32_t)value;
    }

  leave_critical_section(flags);
  nxsched_put_tcb(tcb);
  __asm volatile ("dmb sy" ::: "memory");
  return observed;
}

static int bk7258_ap_bdul_pid_released(pthread_t thread)
{
  pid_t pid = (pid_t)thread;
  irqstate_t flags;
  int released = 1;
  int hash_ndx;

  flags = spin_lock_irqsave_notrace(&g_pidhashlock);
  if (g_pidhash != NULL && g_npidhash > 0 && pid >= 0)
    {
      hash_ndx = PIDHASH(pid);
      if (g_pidhash[hash_ndx] != NULL &&
          g_pidhash[hash_ndx]->pid == pid)
        {
          released = 0;
        }
    }

  spin_unlock_irqrestore_notrace(&g_pidhashlock, flags);
  return released;
}

/* Task A runs on CPU1, executes 8 times, posts B each round. */

static FAR void *bdul_task_a(FAR void *arg)
{
  volatile struct bk7258_ap_advanced_state_s *state = arg;
  uint32_t cycle;
  uint32_t elapsed;
  int ret;

  if (state == NULL)
    {
      return NULL;
    }

  state->task_id[0] = (uint32_t)pthread_self();
  state->task_cpu[0] = (uint32_t)up_cpu_index();
  state->task_started[0]++;
  __asm volatile ("dmb sy" ::: "memory");

  /* Wait to be started by CPU0 post. */

  ret = nxsem_wait_uninterruptible(&g_bdul_sem[0]);
  if (ret < 0)
    {
      state->error = BK7258_AP_BDUL_ERROR_SEM_POST;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      goto done;
    }

  for (cycle = 1; cycle <= BK7258_AP_ADV_CYCLES; cycle++)
    {
      if (up_cpu_index() != BK7258_AP_SECONDARY_CPU)
        {
          state->error = BK7258_AP_BDUL_ERROR_BAD_CPU;
          state->state = BK7258_AP_BDUL_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      state->sequence[0] = cycle;
      __asm volatile ("dmb sy" ::: "memory");

      /* Prove B is waiting before posting. */

      for (elapsed = 0; elapsed < BK7258_AP_ADV_TIMEOUT_MS; elapsed++)
        {
          if (state->task_id[1] != 0 &&
              bdul_exact_waiter(&g_bdul_sem[1],
                                (pthread_t)state->task_id[1],
                                (cpu_set_t)(1u <<
                                  BK7258_AP_SECONDARY_CPU)) == -1)
            {
              break;
            }

          if (state->state == BK7258_AP_BDUL_STATE_FAILED)
            {
              goto done;
            }

          up_mdelay(1);
          (void)sched_yield();
        }

      if (elapsed == BK7258_AP_ADV_TIMEOUT_MS)
        {
          state->error = BK7258_AP_BDUL_ERROR_WAIT_TIMEOUT;
          state->state = BK7258_AP_BDUL_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

