open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
      ret = nxsem_post(&g_bdul_sem[1]);
      if (ret < 0)
        {
          state->error = BK7258_AP_BDUL_ERROR_SEM_POST;
          state->state = BK7258_AP_BDUL_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      /* Wait for B to post us back (rounds 1..7) or done (round 8). */

      if (cycle < BK7258_AP_ADV_CYCLES)
        {
          for (elapsed = 0; elapsed < BK7258_AP_ADV_TIMEOUT_MS; elapsed++)
            {
              __asm volatile ("dmb sy" ::: "memory");
              if (state->sequence[1] == cycle)
                {
                  break;
                }

              if (state->state == BK7258_AP_BDUL_STATE_FAILED)
                {
                  goto done;
                }

              up_mdelay(1);
              (void)sched_yield();
            }

          if (elapsed == BK7258_AP_ADV_TIMEOUT_MS)
            {
              state->error = BK7258_AP_BDUL_ERROR_WAIT_TIMEOUT;
              state->state = BK7258_AP_BDUL_STATE_FAILED;
              __asm volatile ("dmb sy; sev" ::: "memory");
              goto done;
            }

          ret = nxsem_wait_uninterruptible(&g_bdul_sem[0]);
          if (ret < 0)
            {
              state->error = BK7258_AP_BDUL_ERROR_SEM_POST;
              state->state = BK7258_AP_BDUL_STATE_FAILED;
              __asm volatile ("dmb sy; sev" ::: "memory");
              goto done;
            }
        }
    }

done:
  state->task_completed[0]++;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return NULL;
}

/* Task B runs on CPU1, executes 8 times, posts A rounds 1..7 only. */

static FAR void *bdul_task_b(FAR void *arg)
{
  volatile struct bk7258_ap_advanced_state_s *state = arg;
  uint32_t cycle;
  uint32_t elapsed;
  int ret;

  if (state == NULL)
    {
      return NULL;
    }

  state->task_id[1] = (uint32_t)pthread_self();
  state->task_cpu[1] = (uint32_t)up_cpu_index();
  state->task_started[1]++;
  __asm volatile ("dmb sy" ::: "memory");

  for (cycle = 1; cycle <= BK7258_AP_ADV_CYCLES; cycle++)
    {
      /* Wait for A to post us. */

      ret = nxsem_wait_uninterruptible(&g_bdul_sem[1]);
      if (ret < 0)
        {
          state->error = BK7258_AP_BDUL_ERROR_SEM_POST;
          state->state = BK7258_AP_BDUL_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      if (up_cpu_index() != BK7258_AP_SECONDARY_CPU)
        {
          state->error = BK7258_AP_BDUL_ERROR_BAD_CPU;
          state->state = BK7258_AP_BDUL_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      state->sequence[1] = cycle;
      __asm volatile ("dmb sy" ::: "memory");

      /* Post A back for rounds 1..7.  Round 8: no post. */

      if (cycle < BK7258_AP_ADV_CYCLES)
        {
          /* Prove A is waiting before posting. */

          for (elapsed = 0; elapsed < BK7258_AP_ADV_TIMEOUT_MS; elapsed++)
            {
              if (state->task_id[0] != 0 &&
                  bdul_exact_waiter(&g_bdul_sem[0],
                                    (pthread_t)state->task_id[0],
                                    (cpu_set_t)(1u <<
                                      BK7258_AP_SECONDARY_CPU)) == -1)
                {
                  break;
                }

              if (state->state == BK7258_AP_BDUL_STATE_FAILED)
                {
                  goto done;
                }

              up_mdelay(1);
              (void)sched_yield();
            }

          if (elapsed == BK7258_AP_ADV_TIMEOUT_MS)
            {
              state->error = BK7258_AP_BDUL_ERROR_WAIT_TIMEOUT;
              state->state = BK7258_AP_BDUL_STATE_FAILED;
              __asm volatile ("dmb sy; sev" ::: "memory");
              goto done;
            }

          ret = nxsem_post(&g_bdul_sem[0]);
          if (ret < 0)
            {
              state->error = BK7258_AP_BDUL_ERROR_SEM_POST;
              state->state = BK7258_AP_BDUL_STATE_FAILED;
              __asm volatile ("dmb sy; sev" ::: "memory");
              goto done;
            }
        }
    }

done:
  state->task_completed[1]++;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return NULL;
}

int bk7258_ap_smp_bdul_selftest(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_advanced_state_s *state = bk7258_ap_bdul_state();
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
  volatile struct bk7258_ap_ipi_state_s *ipi = bk7258_ap_ipi_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
  pthread_attr_t attr;
  pthread_t thread[2];
  cpu_set_t cpuset1 = (cpu_set_t)(1u << BK7258_AP_SECONDARY_CPU);
  uint32_t elapsed;
  int ret;
  int i;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_ADV_TIMEOUT_MS;
    }

  /* Validate N8-C4 prerequisites. */

  if (smp->magic != BK7258_AP_SMP_STATE_MAGIC ||
      smp->version != BK7258_AP_SMP_STATE_VERSION ||
      smp->size != sizeof(struct bk7258_ap_smp_state_s) ||
      smp->generation != bk7258_ap_boot_state()->generation ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != 0x3u ||
      ipi->magic != BK7258_AP_IPI_STATE_MAGIC ||
      ipi->version != BK7258_AP_IPI_STATE_VERSION ||
      ipi->size != sizeof(struct bk7258_ap_ipi_state_s) ||
      ipi->generation != bk7258_ap_boot_state()->generation ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != 0x3u)
    {
      return -EAGAIN;
    }

  /* Initialize shared state. */

  memset((void *)(uintptr_t)state, 0, sizeof(*state));
  state->version = BK7258_AP_BDUL_STATE_VERSION;
  state->size = sizeof(*state);
  state->generation = bk7258_ap_boot_state()->generation;
  state->state = BK7258_AP_BDUL_STATE_INITIALIZING;
  state->requested = BK7258_AP_ADV_CYCLES;
  state->smp_tx0_before = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_before = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_before = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_before = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_before = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");
  state->magic = BK7258_AP_BDUL_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

