open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
  /* Initialize two semaphores with count 0. */

  for (i = 0; i < 2; i++)
    {
      ret = nxsem_init(&g_bdul_sem[i], 0, 0);
      if (ret < 0)
        {
          state->error = BK7258_AP_BDUL_ERROR_SEM_INIT;
          state->state = BK7258_AP_BDUL_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          return ret;
        }

#ifdef CONFIG_PRIORITY_INHERITANCE
      ret = nxsem_set_protocol(&g_bdul_sem[i], SEM_PRIO_NONE);
      if (ret < 0)
        {
          state->error = BK7258_AP_BDUL_ERROR_SEM_INIT;
          state->state = BK7258_AP_BDUL_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          return ret;
        }
#endif
    }

  /* Create task B first (mask 0x2/CPU1). */

  ret = pthread_attr_init(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BDUL_ERROR_CREATE;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  (void)pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
  (void)pthread_attr_setaffinity_np(&attr, sizeof(cpuset1), &cpuset1);
  state->state = BK7258_AP_BDUL_STATE_RUNNING;
  __asm volatile ("dmb sy" ::: "memory");

  ret = pthread_create(&thread[1], &attr, bdul_task_b,
                       (FAR void *)state);
  (void)pthread_attr_destroy(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BDUL_ERROR_CREATE;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  state->task_id[1] = (uint32_t)thread[1];
  __asm volatile ("dmb sy" ::: "memory");

  /* Create task A (mask 0x2/CPU1). */

  ret = pthread_attr_init(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BDUL_ERROR_CREATE;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  (void)pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
  (void)pthread_attr_setaffinity_np(&attr, sizeof(cpuset1), &cpuset1);

  ret = pthread_create(&thread[0], &attr, bdul_task_a,
                       (FAR void *)state);
  (void)pthread_attr_destroy(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BDUL_ERROR_CREATE;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  state->task_id[0] = (uint32_t)thread[0];
  __asm volatile ("dmb sy" ::: "memory");

  /* Prove task A is blocked before CPU0 performs the only starter wake. */

  for (elapsed = 0; elapsed < timeout_ms; elapsed++)
    {
      if (bdul_exact_waiter(&g_bdul_sem[0], thread[0], cpuset1) == -1)
        {
          break;
        }

      if (state->state == BK7258_AP_BDUL_STATE_FAILED)
        {
          return -EIO;
        }

      up_mdelay(1);
    }

  if (elapsed == timeout_ms)
    {
      state->error = BK7258_AP_BDUL_ERROR_WAIT_TIMEOUT;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ETIMEDOUT;
    }

  /* Post task A to start. */

  ret = nxsem_post(&g_bdul_sem[0]);
  if (ret < 0)
    {
      state->error = BK7258_AP_BDUL_ERROR_SEM_POST;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return ret;
    }

  /* Wait for both tasks to complete and PIDs to be released. */

  for (elapsed = 0; elapsed < timeout_ms * 3; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->task_completed[0] != 0 && state->task_completed[1] != 0)
        {
          if (bk7258_ap_bdul_pid_released(thread[0]) &&
              bk7258_ap_bdul_pid_released(thread[1]))
            {
              state->aux[0] = 1;
              state->aux[1] = 1;
              break;
            }
        }

      if (state->state == BK7258_AP_BDUL_STATE_FAILED)
        {
          return -EIO;
        }

      up_mdelay(1);
    }

  if (elapsed == timeout_ms * 3)
    {
      state->error = BK7258_AP_BDUL_ERROR_WAIT_TIMEOUT;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ETIMEDOUT;
    }

  /* Verify final counter deltas: CPU0->CPU1 +3, CPU1->CPU0 +0, calls +3 */

  __asm volatile ("dmb sy" ::: "memory");
  state->smp_tx0_after = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_after = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_after = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_after = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_after = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");

  if (state->state == BK7258_AP_BDUL_STATE_FAILED)
    {
      return -EIO;
    }

  if (state->smp_tx0_after != state->smp_tx0_before + 3 ||
      state->smp_rx1_after != state->smp_rx1_before + 3 ||
      state->smp_tx1_after != state->smp_tx1_before ||
      state->smp_rx0_after != state->smp_rx0_before ||
      state->calls_after != state->calls_before + 3)
    {
      state->error = BK7258_AP_BDUL_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  if (state->task_started[0] != 1 || state->task_started[1] != 1 ||
      state->task_completed[0] != 1 || state->task_completed[1] != 1 ||
      state->sequence[0] != BK7258_AP_ADV_CYCLES ||
      state->sequence[1] != BK7258_AP_ADV_CYCLES ||
      state->task_cpu[0] != BK7258_AP_SECONDARY_CPU ||
      state->task_cpu[1] != BK7258_AP_SECONDARY_CPU)
    {
      state->error = BK7258_AP_BDUL_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BDUL_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  state->completed = BK7258_AP_ADV_CYCLES;
  state->error = BK7258_AP_BDUL_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_BDUL_STATE_PASSED;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}

#endif /* CONFIG_BK7258_AP_SMP_CPU1_DUALTASK */

/****************************************************************************
 * N8-C7 Controlled Migration
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_CONTROLLED_MIGRATION

