open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
static int bmig_callback_fail(FAR struct bmig_rendezvous_s *rendezvous,
                              uint32_t error, int ret)
{
  volatile struct bk7258_ap_advanced_state_s *state = rendezvous->state;

  if (state != NULL)
    {
      state->error = error;
      __asm volatile ("dmb sy" ::: "memory");
      state->state = BK7258_AP_BMIG_STATE_FAILED;
    }

  rendezvous->callback_completed = rendezvous->cycle;
  __asm volatile ("dmb sy" ::: "memory");
  (void)nxsem_post(&g_bmig_sem);
  __asm volatile ("sev" ::: "memory");
  return ret;
}

static int bmig_migration_callback(FAR void *arg)
{
  FAR struct bmig_rendezvous_s *rendezvous = arg;
  volatile struct bk7258_ap_advanced_state_s *state;
  FAR struct tcb_s *tcb;
  irqstate_t flags;
  uint32_t cycle;
  uint32_t elapsed;
  int blocked = 0;
  int value = 0;
  int ret;

  if (rendezvous == NULL || rendezvous->state == NULL)
    {
      return -EINVAL;
    }

  state = rendezvous->state;
  cycle = rendezvous->cycle;
  if (cycle == 0 || up_cpu_index() != rendezvous->target_cpu)
    {
      return bmig_callback_fail(rendezvous,
                                BK7258_AP_BMIG_ERROR_BAD_CPU, -EIO);
    }

  rendezvous->callback_started = cycle;
  state->value[0] = (int32_t)cycle;
  __asm volatile ("dmb sy; sev" ::: "memory");

  tcb = nxsched_get_tcb((pid_t)rendezvous->thread);
  if (tcb == NULL)
    {
      return bmig_callback_fail(rendezvous,
                                BK7258_AP_BMIG_ERROR_BAD_STATE, -ESRCH);
    }

  /* Wait until the migration task is exactly blocked.  Changing a blocked
   * task's affinity avoids the unsupported running-task remote-delivery path.
   */

  for (elapsed = 0; elapsed < BK7258_AP_ADV_TIMEOUT_MS; elapsed++)
    {
      /* Poll only the atomic semaphore count until the task has decremented
       * it.  Taking an outer critical section in the target IRQ before that
       * point can prevent the source CPU from completing its blocking path.
       */

      ret = nxsem_get_value(&g_bmig_sem, &value);
      if (ret >= 0 && value == -1)
        {
          blocked = 1;
          break;
        }

      if (state->state == BK7258_AP_BMIG_STATE_FAILED)
        {
          nxsched_put_tcb(tcb);
          return -EIO;
        }

      up_mdelay(1);
    }

  if (blocked)
    {
      /* Once the atomic count proves a waiter exists, take the scheduler
       * critical section exactly once to prove the TCB and wait object.
       */

      flags = enter_critical_section();
      ret = nxsem_get_value(&g_bmig_sem, &value);
      blocked = ret >= 0 && tcb->task_state == TSTATE_WAIT_SEM &&
                tcb->waitobj == (FAR void *)&g_bmig_sem && value == -1;
      leave_critical_section(flags);
    }

  nxsched_put_tcb(tcb);
  if (!blocked)
    {
      return bmig_callback_fail(rendezvous,
                                BK7258_AP_BMIG_ERROR_TIMEOUT,
                                -ETIMEDOUT);
    }

  /* Update the blocked task's mask from the target CPU, then post the same
   * semaphore locally so the task resumes on that target CPU.
   */

  ret = pthread_setaffinity_np(rendezvous->thread,
                               sizeof(rendezvous->target),
                               &rendezvous->target);
  if (ret != 0)
    {
      return bmig_callback_fail(rendezvous,
                                BK7258_AP_BMIG_ERROR_SETAFFINITY, -ret);
    }

  tcb = nxsched_get_tcb((pid_t)rendezvous->thread);
  if (tcb == NULL)
    {
      return bmig_callback_fail(rendezvous,
                                BK7258_AP_BMIG_ERROR_BAD_STATE, -ESRCH);
    }

  flags = enter_critical_section();
  ret = nxsem_get_value(&g_bmig_sem, &value);
  blocked = ret >= 0 && tcb->task_state == TSTATE_WAIT_SEM &&
            tcb->waitobj == (FAR void *)&g_bmig_sem && value == -1 &&
            tcb->affinity == rendezvous->target;
  leave_critical_section(flags);
  nxsched_put_tcb(tcb);
  if (!blocked)
    {
      return bmig_callback_fail(rendezvous,
                                BK7258_AP_BMIG_ERROR_GETAFFINITY, -EIO);
    }

  ret = nxsem_post(&g_bmig_sem);
  if (ret < 0)
    {
      return bmig_callback_fail(rendezvous,
                                BK7258_AP_BMIG_ERROR_BAD_STATE, ret);
    }

  rendezvous->callback_completed = cycle;
  state->value[1] = (int32_t)cycle;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}

static FAR void *bmig_migration_task(FAR void *arg)
{
  volatile struct bk7258_ap_advanced_state_s *state = arg;
  cpu_set_t target;
  cpu_set_t observed;
  uint32_t cycle;
  int target_cpu;
  int ret;

  if (state == NULL)
    {
      return NULL;
    }

  state->task_id[0] = (uint32_t)pthread_self();
  state->task_cpu[0] = (uint32_t)up_cpu_index();
  state->task_started[0]++;
  __asm volatile ("dmb sy" ::: "memory");

  for (cycle = 1; cycle <= BK7258_AP_ADV_CYCLES; cycle++)
    {
      /* Odd transitions target 0x2/CPU1, even target 0x1/CPU0. */

      target_cpu = (cycle & 1u) != 0 ? BK7258_AP_SECONDARY_CPU :
                   BK7258_AP_PRIMARY_CPU;
      target = (cpu_set_t)(1u << target_cpu);

      memset(&g_bmig_rendezvous, 0, sizeof(g_bmig_rendezvous));
      g_bmig_rendezvous.state = state;
      g_bmig_rendezvous.thread = pthread_self();
      g_bmig_rendezvous.target = target;
      g_bmig_rendezvous.target_cpu = (uint32_t)target_cpu;
      g_bmig_rendezvous.cycle = cycle;
      __asm volatile ("dmb sy" ::: "memory");

      nxsched_smp_call_init(&g_bmig_call, bmig_migration_callback,
                            &g_bmig_rendezvous);
      ret = nxsched_smp_call_single_async(target_cpu, &g_bmig_call);
      if (ret < 0)
        {
          state->error = BK7258_AP_BMIG_ERROR_BAD_STATE;
          state->state = BK7258_AP_BMIG_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      /* Block immediately after queueing the target callback.  Waiting for a
       * callback-start acknowledgement here can time out before a delayed
       * target IPI is serviced.  The callback already tolerates either order:
       * it waits until this exact task reaches the semaphore.
       */

      ret = nxsem_wait_uninterruptible(&g_bmig_sem);
      if (ret < 0)
        {
          state->error = BK7258_AP_BMIG_ERROR_BAD_STATE;
          state->state = BK7258_AP_BMIG_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      __asm volatile ("dmb sy" ::: "memory");
      if (state->state == BK7258_AP_BMIG_STATE_FAILED)
        {
          goto done;
        }

