open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
      if (g_bmig_rendezvous.callback_completed != cycle)
        {
          state->error = BK7258_AP_BMIG_ERROR_TIMEOUT;
          state->state = BK7258_AP_BMIG_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      /* Verify affinity and CPU after the target-local wake. */

      observed = 0;
      ret = pthread_getaffinity_np(pthread_self(), sizeof(observed),
                                   &observed);
      if (ret != 0 || observed != target)
        {
          state->error = BK7258_AP_BMIG_ERROR_GETAFFINITY;
          state->state = BK7258_AP_BMIG_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      if (up_cpu_index() != target_cpu)
        {
          state->error = BK7258_AP_BMIG_ERROR_BAD_CPU;
          state->state = BK7258_AP_BMIG_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      state->sequence[0] = cycle;
      state->task_cpu[0] = (uint32_t)up_cpu_index();
      __asm volatile ("dmb sy; sev" ::: "memory");
    }

done:
  state->task_completed[0]++;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return NULL;
}

static int bk7258_ap_bmig_pid_released(pthread_t thread)
{
  pid_t pid = (pid_t)thread;
  irqstate_t flags;
  int released = 1;
  int hash_ndx;

  flags = spin_lock_irqsave_notrace(&g_pidhashlock);
  if (g_pidhash != NULL && g_npidhash > 0 && pid >= 0)
    {
      hash_ndx = PIDHASH(pid);
      if (g_pidhash[hash_ndx] != NULL &&
          g_pidhash[hash_ndx]->pid == pid)
        {
          released = 0;
        }
    }

  spin_unlock_irqrestore_notrace(&g_pidhashlock, flags);
  return released;
}

int bk7258_ap_smp_bmig_selftest(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_advanced_state_s *state = bk7258_ap_bmig_state();
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
  volatile struct bk7258_ap_ipi_state_s *ipi = bk7258_ap_ipi_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
  pthread_attr_t attr;
  pthread_t thread;
  cpu_set_t cpuset = (cpu_set_t)(1u << BK7258_AP_PRIMARY_CPU);
  uint32_t elapsed;
  int ret;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_ADV_TIMEOUT_MS;
    }

  /* Validate N8-C4 prerequisites. */

  if (smp->magic != BK7258_AP_SMP_STATE_MAGIC ||
      smp->version != BK7258_AP_SMP_STATE_VERSION ||
      smp->size != sizeof(struct bk7258_ap_smp_state_s) ||
      smp->generation != bk7258_ap_boot_state()->generation ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != 0x3u ||
      ipi->magic != BK7258_AP_IPI_STATE_MAGIC ||
      ipi->version != BK7258_AP_IPI_STATE_VERSION ||
      ipi->size != sizeof(struct bk7258_ap_ipi_state_s) ||
      ipi->generation != bk7258_ap_boot_state()->generation ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != 0x3u)
    {
      return -EAGAIN;
    }

  /* Initialize shared state. */

  memset((void *)(uintptr_t)state, 0, sizeof(*state));
  state->version = BK7258_AP_BMIG_STATE_VERSION;
  state->size = sizeof(*state);
  state->generation = bk7258_ap_boot_state()->generation;
  state->state = BK7258_AP_BMIG_STATE_INITIALIZING;
  state->requested = BK7258_AP_ADV_CYCLES;
  state->smp_tx0_before = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_before = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_before = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_before = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_before = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");
  state->magic = BK7258_AP_BMIG_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

  memset(&g_bmig_rendezvous, 0, sizeof(g_bmig_rendezvous));
  ret = nxsem_init(&g_bmig_sem, 0, 0);
  if (ret < 0)
    {
      state->error = BK7258_AP_BMIG_ERROR_BAD_STATE;
      state->state = BK7258_AP_BMIG_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return ret;
    }

#ifdef CONFIG_PRIORITY_INHERITANCE
  ret = nxsem_set_protocol(&g_bmig_sem, SEM_PRIO_NONE);
  if (ret < 0)
    {
      state->error = BK7258_AP_BMIG_ERROR_BAD_STATE;
      state->state = BK7258_AP_BMIG_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return ret;
    }
#endif

  /* Create detached task with mask 0x1/CPU0. */

  ret = pthread_attr_init(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BMIG_ERROR_CREATE;
      state->state = BK7258_AP_BMIG_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  (void)pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
  (void)pthread_attr_setaffinity_np(&attr, sizeof(cpuset), &cpuset);
  state->state = BK7258_AP_BMIG_STATE_RUNNING;
  __asm volatile ("dmb sy" ::: "memory");

  ret = pthread_create(&thread, &attr, bmig_migration_task,
                       (FAR void *)state);
  (void)pthread_attr_destroy(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BMIG_ERROR_CREATE;
      state->state = BK7258_AP_BMIG_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  state->task_id[0] = (uint32_t)thread;
  __asm volatile ("dmb sy" ::: "memory");

  /* Wait for task to complete and PID to be released. */

  for (elapsed = 0; elapsed < timeout_ms * 3; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->task_completed[0] != 0)
        {
          if (bk7258_ap_bmig_pid_released(thread))
            {
              state->aux[0] = 1;
              break;
            }
        }

      if (state->state == BK7258_AP_BMIG_STATE_FAILED)
        {
          return -EIO;
        }

      /* The controller and migration task both start on CPU0. */

      (void)nxsig_usleep(1000);
    }

  if (elapsed == timeout_ms * 3)
    {
      state->error = BK7258_AP_BMIG_ERROR_TIMEOUT;
      state->state = BK7258_AP_BMIG_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ETIMEDOUT;
    }

  /* Verify: tx/rx +4 each direction, calls +8. */

  __asm volatile ("dmb sy" ::: "memory");
  state->smp_tx0_after = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_after = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_after = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_after = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_after = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");

