open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
  if (state->state == BK7258_AP_BMIG_STATE_FAILED)
    {
      return -EIO;
    }

  if (state->smp_tx0_after != state->smp_tx0_before + 4 ||
      state->smp_rx1_after != state->smp_rx1_before + 4 ||
      state->smp_tx1_after != state->smp_tx1_before + 4 ||
      state->smp_rx0_after != state->smp_rx0_before + 4 ||
      state->calls_after != state->calls_before + 8)
    {
      state->error = BK7258_AP_BMIG_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BMIG_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  if (state->task_started[0] != 1 || state->task_completed[0] != 1 ||
      state->sequence[0] != BK7258_AP_ADV_CYCLES)
    {
      state->error = BK7258_AP_BMIG_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BMIG_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  state->completed = BK7258_AP_ADV_CYCLES;
  state->error = BK7258_AP_BMIG_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_BMIG_STATE_PASSED;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}

#endif /* CONFIG_BK7258_AP_SMP_CONTROLLED_MIGRATION */

/****************************************************************************
 * N8-C8 Timed Wake
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_CPU1_TIMED_WAKE

static FAR void *btim_timed_task(FAR void *arg)
{
  volatile struct bk7258_ap_advanced_state_s *state = arg;
  uint32_t cycle;
  int ret;

  if (state == NULL)
    {
      return NULL;
    }

  state->task_id[0] = (uint32_t)pthread_self();
  state->task_cpu[0] = (uint32_t)up_cpu_index();
  state->task_started[0]++;
  __asm volatile ("dmb sy" ::: "memory");

  for (cycle = 1; cycle <= BK7258_AP_ADV_CYCLES; cycle++)
    {
      state->value[0] = (int32_t)cycle;
      __asm volatile ("dmb sy" ::: "memory");

      ret = nxsig_usleep(BK7258_AP_ADV_TIMED_INTERVAL_US);
      __asm volatile ("dmb sy" ::: "memory");

      state->value[1] = (int32_t)ret;
      state->sequence[0] = cycle;

      if (ret < 0)
        {
          state->error = BK7258_AP_BTIM_ERROR_SLEEP;
          state->state = BK7258_AP_BTIM_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      if (up_cpu_index() != BK7258_AP_SECONDARY_CPU)
        {
          state->error = BK7258_AP_BTIM_ERROR_BAD_CPU;
          state->state = BK7258_AP_BTIM_STATE_FAILED;
          __asm volatile ("dmb sy; sev" ::: "memory");
          goto done;
        }

      __asm volatile ("dmb sy; sev" ::: "memory");
    }

done:
  state->task_completed[0]++;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return NULL;
}

static int bk7258_ap_btim_pid_released(pthread_t thread)
{
  pid_t pid = (pid_t)thread;
  irqstate_t flags;
  int released = 1;
  int hash_ndx;

  flags = spin_lock_irqsave_notrace(&g_pidhashlock);
  if (g_pidhash != NULL && g_npidhash > 0 && pid >= 0)
    {
      hash_ndx = PIDHASH(pid);
      if (g_pidhash[hash_ndx] != NULL &&
          g_pidhash[hash_ndx]->pid == pid)
        {
          released = 0;
        }
    }

  spin_unlock_irqrestore_notrace(&g_pidhashlock, flags);
  return released;
}

int bk7258_ap_smp_btim_selftest(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_advanced_state_s *state = bk7258_ap_btim_state();
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
  volatile struct bk7258_ap_ipi_state_s *ipi = bk7258_ap_ipi_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
  pthread_attr_t attr;
  pthread_t thread;
  cpu_set_t cpuset = (cpu_set_t)(1u << BK7258_AP_SECONDARY_CPU);
  uint32_t elapsed;
  int ret;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_ADV_TIMEOUT_MS;
    }

  /* Validate N8-C4 prerequisites. */

  if (smp->magic != BK7258_AP_SMP_STATE_MAGIC ||
      smp->version != BK7258_AP_SMP_STATE_VERSION ||
      smp->size != sizeof(struct bk7258_ap_smp_state_s) ||
      smp->generation != bk7258_ap_boot_state()->generation ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != 0x3u ||
      ipi->magic != BK7258_AP_IPI_STATE_MAGIC ||
      ipi->version != BK7258_AP_IPI_STATE_VERSION ||
      ipi->size != sizeof(struct bk7258_ap_ipi_state_s) ||
      ipi->generation != bk7258_ap_boot_state()->generation ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != 0x3u)
    {
      return -EAGAIN;
    }

  /* Initialize shared state. */

  memset((void *)(uintptr_t)state, 0, sizeof(*state));
  state->version = BK7258_AP_BTIM_STATE_VERSION;
  state->size = sizeof(*state);
  state->generation = bk7258_ap_boot_state()->generation;
  state->state = BK7258_AP_BTIM_STATE_INITIALIZING;
  state->requested = BK7258_AP_ADV_CYCLES;
  state->aux[0] = BK7258_AP_ADV_TIMED_INTERVAL_US;
  state->smp_tx0_before = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_before = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_before = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_before = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_before = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");
  state->magic = BK7258_AP_BTIM_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

  /* Create detached task with mask 0x2/CPU1. */

  ret = pthread_attr_init(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BTIM_ERROR_CREATE;
      state->state = BK7258_AP_BTIM_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  (void)pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
  (void)pthread_attr_setaffinity_np(&attr, sizeof(cpuset), &cpuset);
  state->state = BK7258_AP_BTIM_STATE_RUNNING;
  __asm volatile ("dmb sy" ::: "memory");

  ret = pthread_create(&thread, &attr, btim_timed_task,
                       (FAR void *)state);
  (void)pthread_attr_destroy(&attr);
  if (ret != 0)
    {
      state->error = BK7258_AP_BTIM_ERROR_CREATE;
      state->state = BK7258_AP_BTIM_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ret;
    }

  state->task_id[0] = (uint32_t)thread;
  __asm volatile ("dmb sy" ::: "memory");

  /* Wait for task to complete and PID to be released. */

  for (elapsed = 0; elapsed < timeout_ms * 3; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->task_completed[0] != 0)
        {
          if (bk7258_ap_btim_pid_released(thread))
            {
              state->aux[1] = 1;
              break;
            }
        }

      if (state->state == BK7258_AP_BTIM_STATE_FAILED)
        {
          return -EIO;
        }

      up_mdelay(1);
    }

  if (elapsed == timeout_ms * 3)
    {
      state->error = BK7258_AP_BTIM_ERROR_TIMEOUT;
      state->state = BK7258_AP_BTIM_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -ETIMEDOUT;
    }

