open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
  /* Verify: initial CPU1 dispatch + 8 timer wakes. */

  __asm volatile ("dmb sy" ::: "memory");
  state->smp_tx0_after = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_after = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_after = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_after = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_after = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");

  if (state->state == BK7258_AP_BTIM_STATE_FAILED)
    {
      return -EIO;
    }

  if (state->smp_tx0_after != state->smp_tx0_before +
                                  BK7258_AP_ADV_CYCLES + 1 ||
      state->smp_rx1_after != state->smp_rx1_before +
                                  BK7258_AP_ADV_CYCLES + 1 ||
      state->smp_tx1_after != state->smp_tx1_before ||
      state->smp_rx0_after != state->smp_rx0_before ||
      state->calls_after != state->calls_before +
                                  BK7258_AP_ADV_CYCLES + 1)
    {
      state->error = BK7258_AP_BTIM_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BTIM_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  if (state->task_started[0] != 1 || state->task_completed[0] != 1 ||
      state->sequence[0] != BK7258_AP_ADV_CYCLES)
    {
      state->error = BK7258_AP_BTIM_ERROR_COUNT_MISMATCH;
      state->state = BK7258_AP_BTIM_STATE_FAILED;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EIO;
    }

  state->completed = BK7258_AP_ADV_CYCLES;
  state->error = BK7258_AP_BTIM_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_BTIM_STATE_PASSED;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}

#endif /* CONFIG_BK7258_AP_SMP_CPU1_TIMED_WAKE */

/****************************************************************************
 * N8-D1 Scheduler Quiesce/Resume Foundation
 ****************************************************************************/

#ifdef CONFIG_BK7258_AP_SMP_LIFECYCLE_QUIESCE

static void blcy_fail(
  volatile struct bk7258_ap_advanced_state_s *state, uint32_t error)
{
  if (state->error == BK7258_AP_BLCY_ERROR_NONE)
    {
      state->error = error;
    }

  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_BLCY_STATE_FAILED;
  __asm volatile ("dmb sy; sev" ::: "memory");
}

static int blcy_abort(
  volatile struct bk7258_ap_advanced_state_s *state, uint32_t error,
  int ret)
{
  blcy_fail(state, error);
  state->sequence[1] = 1;
  __asm volatile ("dsb sy; sev" ::: "memory");
  return ret;
}

static int blcy_quiesce_callback(FAR void *arg)
{
  volatile struct bk7258_ap_advanced_state_s *state = arg;
  int cpu;

  if (state == NULL)
    {
      return -EINVAL;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (state->magic != BK7258_AP_BLCY_STATE_MAGIC ||
      state->version != BK7258_AP_BLCY_STATE_VERSION ||
      state->size != sizeof(struct bk7258_ap_advanced_state_s) ||
      state->generation != bk7258_ap_boot_state()->generation ||
      state->state != BK7258_AP_BLCY_STATE_RUNNING ||
      state->error != BK7258_AP_BLCY_ERROR_NONE)
    {
      state->value[0] = -EAGAIN;
      blcy_fail(state, BK7258_AP_BLCY_ERROR_BAD_STATE);
      return -EAGAIN;
    }

  cpu = up_cpu_index();
  if (cpu != BK7258_AP_SECONDARY_CPU)
    {
      state->value[0] = -EINVAL;
      blcy_fail(state, BK7258_AP_BLCY_ERROR_BAD_CPU);
      return -EINVAL;
    }

  /* This asynchronous SMP callback remains in the CPU1 call-handler context
   * until CPU0 publishes the resume sequence and executes SEV.  It does not
   * change NuttX's online mask, disable CPU1 interrupts, reset CPU2, or claim
   * scheduler hot-unplug support.
   */

  state->task_cpu[0] = (uint32_t)cpu;
  state->task_started[0]++;
  state->sequence[0] = 1;
  state->aux[0] = 1;
  __asm volatile ("dsb sy; sev" ::: "memory");

  for (; ; )
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->state == BK7258_AP_BLCY_STATE_FAILED)
        {
          state->value[0] = -ECANCELED;
          state->task_cpu[1] = (uint32_t)up_cpu_index();
          state->task_completed[0]++;
          __asm volatile ("dmb sy; sev" ::: "memory");
          return -ECANCELED;
        }

      if (state->sequence[1] == 1)
        {
          break;
        }

      __asm volatile ("wfe" ::: "memory");
    }

  cpu = up_cpu_index();
  if (cpu != BK7258_AP_SECONDARY_CPU)
    {
      state->value[0] = -EINVAL;
      blcy_fail(state, BK7258_AP_BLCY_ERROR_BAD_CPU);
      state->task_cpu[1] = (uint32_t)cpu;
      state->task_completed[0]++;
      __asm volatile ("dmb sy; sev" ::: "memory");
      return -EINVAL;
    }

  state->task_cpu[1] = (uint32_t)cpu;
  state->aux[1] = 1;
  state->value[0] = OK;
  state->task_completed[0]++;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}

int bk7258_ap_smp_blcy_selftest(uint32_t timeout_ms)
{
  volatile struct bk7258_ap_advanced_state_s *state = bk7258_ap_blcy_state();
  volatile struct bk7258_ap_smp_state_s *smp = bk7258_ap_smp_state();
  volatile struct bk7258_ap_ipi_state_s *ipi = bk7258_ap_ipi_state();
  volatile struct bk7258_cpu2_probe_state_s *cpu2 =
    bk7258_cpu2_probe_state();
  uint32_t elapsed;
  int ret;

  if (timeout_ms == 0)
    {
      timeout_ms = BK7258_AP_ADV_TIMEOUT_MS;
    }

  /* Validate N8-C4 prerequisites. */

  if (smp->magic != BK7258_AP_SMP_STATE_MAGIC ||
      smp->version != BK7258_AP_SMP_STATE_VERSION ||
      smp->size != sizeof(struct bk7258_ap_smp_state_s) ||
      smp->generation != bk7258_ap_boot_state()->generation ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != 0x3u ||
      ipi->magic != BK7258_AP_IPI_STATE_MAGIC ||
      ipi->version != BK7258_AP_IPI_STATE_VERSION ||
      ipi->size != sizeof(struct bk7258_ap_ipi_state_s) ||
      ipi->generation != bk7258_ap_boot_state()->generation ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != 0x3u)
    {
      return -EAGAIN;
    }

  memset((void *)(uintptr_t)state, 0, sizeof(*state));
  state->version = BK7258_AP_BLCY_STATE_VERSION;
  state->size = sizeof(*state);
  state->generation = bk7258_ap_boot_state()->generation;
  state->state = BK7258_AP_BLCY_STATE_INITIALIZING;
  state->requested = 1;
  state->value[0] = INT32_MIN;
  state->value[1] = INT32_MIN;
  __asm volatile ("dmb sy" ::: "memory");
  state->magic = BK7258_AP_BLCY_STATE_MAGIC;
  __asm volatile ("dmb sy" ::: "memory");

