open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_ap_smp_advanced.c
  /* Scheduler-online CPU2 stop must remain fail-closed.  This call is made
   * before the quiesce callback is dispatched and must have no hardware side
   * effects in scheduler-online mode.
   */

  ret = bk7258_ap_smp_secondary_stop(timeout_ms);
  state->value[1] = (int32_t)ret;
  __asm volatile ("dmb sy" ::: "memory");
  if (ret != -ENOTSUP)
    {
      blcy_fail(state, BK7258_AP_BLCY_ERROR_STOP_GATE);
      return -EIO;
    }

  state->smp_tx0_before = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_before = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_before = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_before = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_before = cpu2->smp_call_requests;
  state->state = BK7258_AP_BLCY_STATE_RUNNING;
  __asm volatile ("dmb sy" ::: "memory");

  nxsched_smp_call_init(&g_blcy_quiesce_call, blcy_quiesce_callback,
                        (FAR void *)state);
  ret = nxsched_smp_call_single_async(BK7258_AP_SECONDARY_CPU,
                                      &g_blcy_quiesce_call);
  if (ret < 0)
    {
      return blcy_abort(state, BK7258_AP_BLCY_ERROR_CALL, ret);
    }

  /* Wait until CPU1 has entered the bounded scheduler-quiesce callback. */

  for (elapsed = 0; elapsed < timeout_ms; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->task_started[0] == 1 && state->sequence[0] == 1 &&
          state->aux[0] == 1 &&
          state->task_cpu[0] == BK7258_AP_SECONDARY_CPU)
        {
          break;
        }

      if (state->state == BK7258_AP_BLCY_STATE_FAILED)
        {
          return blcy_abort(state, state->error, -EIO);
        }

      up_mdelay(1);
    }

  if (elapsed == timeout_ms)
    {
      return blcy_abort(state, BK7258_AP_BLCY_ERROR_QUIESCE_TIMEOUT,
                        -ETIMEDOUT);
    }

  /* CPU1 remains NuttX-online while its scheduler call handler is held. */

  __asm volatile ("dmb sy" ::: "memory");
  if (smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != 0x3u ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != 0x3u)
    {
      return blcy_abort(state, BK7258_AP_BLCY_ERROR_BAD_STATE, -EIO);
    }

  state->sequence[1] = 1;
  __asm volatile ("dsb sy; sev" ::: "memory");

  /* Wait until the callback resumes and exits on CPU1. */

  for (elapsed = 0; elapsed < timeout_ms; elapsed++)
    {
      __asm volatile ("dmb sy" ::: "memory");
      if (state->task_completed[0] == 1 && state->aux[1] == 1 &&
          state->task_cpu[1] == BK7258_AP_SECONDARY_CPU)
        {
          break;
        }

      if (state->state == BK7258_AP_BLCY_STATE_FAILED)
        {
          return blcy_abort(state, state->error, -EIO);
        }

      up_mdelay(1);
    }

  if (elapsed == timeout_ms)
    {
      return blcy_abort(state, BK7258_AP_BLCY_ERROR_RESUME_TIMEOUT,
                        -ETIMEDOUT);
    }

  __asm volatile ("dmb sy" ::: "memory");
  state->smp_tx0_after = smp->tx_count[BK7258_AP_PRIMARY_CPU];
  state->smp_rx1_after = smp->rx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_tx1_after = smp->tx_count[BK7258_AP_SECONDARY_CPU];
  state->smp_rx0_after = smp->rx_count[BK7258_AP_PRIMARY_CPU];
  state->calls_after = cpu2->smp_call_requests;
  __asm volatile ("dmb sy" ::: "memory");

  if (state->state == BK7258_AP_BLCY_STATE_FAILED)
    {
      return -EIO;
    }

  if (state->smp_tx0_after != state->smp_tx0_before + 1 ||
      state->smp_rx1_after != state->smp_rx1_before + 1 ||
      state->smp_tx1_after != state->smp_tx1_before ||
      state->smp_rx0_after != state->smp_rx0_before ||
      state->calls_after != state->calls_before + 1 ||
      state->requested != 1 || state->task_started[0] != 1 ||
      state->task_completed[0] != 1 || state->sequence[0] != 1 ||
      state->sequence[1] != 1 || state->aux[0] != 1 ||
      state->aux[1] != 1 || state->value[0] != OK ||
      state->value[1] != -ENOTSUP ||
      state->task_cpu[0] != BK7258_AP_SECONDARY_CPU ||
      state->task_cpu[1] != BK7258_AP_SECONDARY_CPU ||
      smp->state != BK7258_AP_SMP_STATE_PASSED ||
      smp->error != BK7258_AP_SMP_ERROR_NONE ||
      smp->online_mask != 0x3u ||
      ipi->state != BK7258_AP_IPI_STATE_READY ||
      ipi->error != BK7258_AP_IPI_ERROR_NONE ||
      cpu2->state != BK7258_CPU2_PROBE_STATE_SCHEDULER_ONLINE ||
      cpu2->online_mask != 0x3u)
    {
      blcy_fail(state, BK7258_AP_BLCY_ERROR_COUNT_MISMATCH);
      return -EIO;
    }

  state->completed = 1;
  state->error = BK7258_AP_BLCY_ERROR_NONE;
  __asm volatile ("dmb sy" ::: "memory");
  state->state = BK7258_AP_BLCY_STATE_PASSED;
  __asm volatile ("dmb sy; sev" ::: "memory");
  return OK;
}

#endif /* CONFIG_BK7258_AP_SMP_LIFECYCLE_QUIESCE */

#endif /* any advanced config enabled */
